[
  {
    "group": "code",
    "project": "timelist",
    "bckimg": "/images/cpro/listlift.png",
    "title": "24hour++ timelist",
    "captions": "yes",
    "date": "January 2018",
    "hreff": "/projects/timelist",
    "preview": "Composed a minimal module for simplifying the conversion of time inputs relative to the Unix timestamp on submit and storing both values as a bigint data type in the postgresql; Dynamically displaying multiple animated countdowns converted to the UTC timestring; One-page layout with CSS 3D transforms properties.",
    "screencast": "https://player.vimeo.com/video/261029371?autoplay=1&loop=1&title=0&byline=0&portrait=0",
    "gitrepo" : "https://github.com/Rainman24/timelist",
    "extra": [
      "During last two weeks of the course we were assigned to build a final project. My goal was to build a three dimensional layout with functionality of a customised countdown list that works within the scope of today and tomorrow. This idea was meant to exercise both front and back-end abilities. Additionally I have decided to restrict myself on the early stages of the project by using minimal resources, in order to exercise the fundamentals and test their limits before transitioning to more advanced tools that I was already familiar with.",
      "Usually before disposing an empty package I compress it so it takes as little space in the bin, this habit is automatic and is done unconsciously and slightly negligent since the package itself is obsolete. Yet one night in the end of the course I was about to dispose of a cardboard tea package, but instead of reaping it apart I have carefully unfolded it to its 2 dimensional layout, and its outline reminded me of a website schema.",
      "If the navigation bar and the main content are originally filling the viewport, then all other elements are displayed due to the client side interaction and in this case the layout might not require any specific event handlers since the structure is fitting the natural document flow. So if the layout placed on a 2D schema is already part of the document on load, then I got curious how it would look in its “folded” state. From this point I’ve started to experiment with the transform property and made some try outs.",
      "In the example above I’ve got a sense of how with at least four div elements and the transform property in CSS I can achieve to present the whole page layout within the viewport aspect ratio, so while being able to interact with the contents of a single section, other parts of the webpage remain visible and accessible at all times. Since the layout has a depth it as well becomes an enclosed space that might become an asset in a right context. For instance if it becomes accessible only as a feature of a personal profile that provides functionalities which output is convenient to be displayed in proximity to each other.",
      "As someone who has a specific relation to “To-Do” lists, I have always wished to be able to construct one in a less linear fashion, but without the threat of turning it in a bucket list. The asynchronous nature of Node.js was first explained to us with an analogy to the sequence of simple actions required to do some household chores. So while certain things have to be executed in a strict order, other can be done meanwhile. For example it would be absurdly comical to iron the clothes before putting them into the dryer, while it would be time-efficient to prepare food while the laundry is in the washing machine. And even though the logic behind this seems to be obvious, but only as long as it concerns familiar environment."
    ],
    "extrav": "/images/boxlayout1.png",
    "extraf": ["/images/room.png","/images/persp.png"]
  },
  {
    "group": "code",
    "project": "uia",
    "bckimg": "/images/cpro/UIAadduser.png",
    "title": "User Information App",
    "captions": "JSON API using RESTful design and a autocomplete searchbar",
    "date": "November 2017",
    "hreff": "/projects/uia",
    "preview": "The searchbar post requst is handled both on the server and client-side. Due to Ajax implementation, user suggestions are dynamically rendered on the keyup event. A selected suggestion on submit, redirects to the specific window location of the user in the userlist url.",
    "screencast": "https://player.vimeo.com/video/265847319?autoplay=1&loop=1&title=0&byline=0&portrait=0",
    "gitrepo" : "https://github.com/Rainman24/UIA"
  },
  {
    "group": "code",
    "project": "bwt",
    "bckimg": "/images/cpro/gal2.png",
    "title": "Bussines Website Template",
    "captions": "Simple Website built on week two on the course",
    "date": "November 2017",
    "hreff": "/projects/bwt",
    "preview": "By no means this is a remarkable example of my current work, but rather a demonstration of a first milestone in learning. To be specific - a project made within 4 days after one week of becoming acquainted with the basics of HTML, CSS and jQuery.",
    "screencast": "https://player.vimeo.com/video/261057223?autoplay=1&loop=1&title=0&byline=0&portrait=0"
  },
  {
    "group": "code",
    "project": "$(this)",
    "bckimg": "/images/cpro/gridTemplate.png",
    "title": "This is it",
    "captions": "Gottcha",
    "date": "March 2018",
    "hreff": "/",
    "preview": "Here you can find the link to the github repository of the code for this website and the screencast of its early prototype.",
    "screencast": "https://player.vimeo.com/video/261059350?autoplay=1&loop=1&title=0&byline=0&portrait=0",
    "gitrepo": "https://github.com/Rainman24/mfwo"
  },
  {
    "group": "visual",
    "project": "oudekerk15",
    "bckimg": "/images/okled.jpeg",
    "title": "Oude Kerk 15",
    "captions": "Tribute to the progressive quality of public service announcements in Amsterdam",
    "date": "April 2015",
    "hreff": "/projects/oudekerk15",
    "preview": "Tribute to the progressive quality of public service announcements in Amsterdam.",
    "screencast": "https://player.vimeo.com/video/183824434?title=0&byline=0&portrait=0"
  },
  {
    "group": "visual",
    "project": "nonsense",
    "bckimg": "/images/nonsenselandscape.png",
    "title": "Non Sense",
    "captions": "Windows 95 Dual Core Processor",
    "date": "April 2017",
    "hreff": "/projects/nonsense",
    "preview": "Spin off visual identity for the Windows 95 Dual Core Processor."
  },
  {
    "group": "visual",
    "project": "commonsense",
    "bckimg": "/images/CommonSenseFINAL.png",
    "title": "Common Sense",
    "captions": "Hello",
    "date": "April 2017",
    "hreff": "/projects/commonsense",
    "preview": "This title may or may not be of deceptive nature."
  },
  {
    "group": "visual",
    "project": "it",
    "bckimg": "/images/IT/4.png",
    "title": "Humanism",
    "captions": "Italy",
    "date": "August 2013",
    "hreff": "/projects/it",
    "preview": "It's a photo of people resting on a terrace."
  },
  {
    "group": "visual",
    "project": "foo",
    "bckimg": "/images/foopho-crops/eggel.png",
    "title": "Kitchen Counter Entropy",
    "captions": "foopho",
    "date": "Dec 2015",
    "hreff": "/projects/foo",
    "preview": "A visual tale of an undergrad coping with personal dysfunctionality by attempting to find and capture harmony within domestic chaos."
  },
  {
    "group": "visual",
    "project": "wikiFriends",
    "bckimg": "/images/Friends.png",
    "title": "Blame it on the Social Constructs",
    "captions": "WikiHow to Make Friends",
    "date": "April 2017",
    "hreff": "/projects/wikiFriends"
  },
  {
    "group": "visual",
    "project": "lotemplate",
    "bckimg": "/images/template.png",
    "title": "Medium is the template is the message is the content",
    "captions": "co",
    "date": "May 2017",
    "hreff": "/projects/lotemplate"
  },
  {
    "group": "visual",
    "project": "negtau",
    "bckimg": "/images/NS_WhiteTaurus.png",
    "title": "Negative Space Res",
    "captions": "Negative Space Res",
    "date": "April 2017",
    "hreff": "/projects/negtau"
  },
  {
    "group": "visual",
    "project": "fieldreport",
    "bckimg": "/images/FR3.png",
    "title": "Field Repord Visual Identity",
    "captions": "Field Report",
    "date": "January 2016",
    "hreff": "/projects/fieldreport"
  },
  {
    "group": "visual",
    "project": "mihalk",
    "bckimg": "/images/mihalk.png",
    "title": "Desktop Fan Art",
    "captions": "browser",
    "date": "October 2018",
    "hreff": "/projects/mihalk"
  }
]